#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/james-personal-account/aws-nuclei/runs/run-tdrvvwrhtZHfK9xs

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_apigatewayv2_api.lambda: Refreshing state... [id=sdwwn04i87]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/serverless_lambda_gw]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220613060156176300000001]
aws_lambda_function.crawler: Refreshing state... [id=crawler]
aws_lambda_function.test_lambda: Refreshing state... [id=hello_world]
aws_apigatewayv2_stage.lambda: Refreshing state... [id=serverless_lambda_stage]
aws_lambda_permission.api_gw: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.test_lambda: Refreshing state... [id=mwf2urb]
aws_lambda_function_url.test_live: Refreshing state... [id=hello_world]
aws_cloudwatch_log_group.test_lambda: Refreshing state... [id=/aws/lambda/hello_world]
aws_apigatewayv2_route.test_lambda: Refreshing state... [id=jjdogw5]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.crawler will be created
  + resource "aws_cloudwatch_log_group" "crawler" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/crawler"
      + retention_in_days = 3
      + tags_all          = (known after apply)
    }

  # aws_iam_role.crawler_role will be created
  + resource "aws_iam_role" "crawler_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawler_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.crawler_policy_attach1 will be created
  + resource "aws_iam_role_policy_attachment" "crawler_policy_attach1" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "crawler_role"
    }

  # aws_iam_role_policy_attachment.crawler_policy_attach2 will be created
  + resource "aws_iam_role_policy_attachment" "crawler_policy_attach2" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = "crawler_role"
    }

  # aws_lambda_function.crawler will be updated in-place
  ~ resource "aws_lambda_function" "crawler" {
        id                             = "crawler"
      ~ last_modified                  = "2022-06-13T06:45:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "NuYPP8x68difB+sM7UFmDG6w7iR5EaS26bmykkSshec=" -> "AsxeEzAc497Okv51kOk5ZT2QsZujSqlgpCSHMpbOCO4="
        tags                           = {}
      ~ timeout                        = 10 -> 3
        # (17 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_function.test_lambda will be updated in-place
  ~ resource "aws_lambda_function" "test_lambda" {
        id                             = "hello_world"
      ~ last_modified                  = "2022-06-13T06:43:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "gVRAx3M4rgBfPutgJir/cQyBR2QJqnASI6KWOpUmtac=" -> "0o/7PoaLwWL7cV40uZU7gcJyWVgEb5dxLtkfD36yl1s="
        tags                           = {}
        # (18 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.


```

</details>

*Pushed by: @Jamolo5, Action: `pull_request`*